app/controllers/schoolclasses_controller.rb

INSERT INTO "schoolclasses" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Math 101"], ["room_number", 156], ["created_at", "2020-03-08 03:23:33.742725"], ["updated_at", "2020-03-08 03:23:33.742725"]]
---
    def create
        @schoolclass = Schoolclass.new(schoolclass_params)
        @schoolclass.save

UPDATE "schoolclasses" SET "room_number" = ?, "updated_at" = ? WHERE "schoolclasses"."id" = ?  [["room_number", 125], ["updated_at", "2020-03-08 03:24:31.890578"], ["id", 1]]
---
    def update
        find_schoolclass
        @schoolclass.update(schoolclass_params)

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def find_schoolclass
        @schoolclass = Schoolclass.find(params[:id])