app/controllers/students_controller.rb

    def update
        find_student
        @student.update(student_params)
---
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Dog"], ["updated_at", "2020-03-08 03:12:42.054304"], ["id", 3]]